{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c40"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "Long walk up on the burning tiles, as your bear feet start to become grilled, the reward is a large statue hurting your eyes in the sun. Half views of Kandy, not really special. Before you walk down you will be asked to make a donation as a foreigner."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c41"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "Unfortunately it was very hot afternoon when we reached this place. To remove the shoes to go up to the statue was painful. Plan a trip in the evening or when you think it would be comfortable to move and walk without shoes on the marble stairs."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c42"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "The perfect spot to have a sight on Kandy. The statue is amazing and you must wear a long dress to go in. 250 Rs. Fair."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c43"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "It's a nice temple to visit but our aim in going there was for the views over Kandy. It's very high up and ha great views of the town. It's 250 R entry. Slightly annoying in that once you enter - other staff then ask you for donations for the temple."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c44"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "Very huge Buddha, you can ask a tuk tuk driver to bring you there, I wouldn't bother pay to go in though, as you can easily look at it from outside"
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c45"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "The view is good, but it has got a very bad road and we spent hours in traffic jam. When we arrived, they asked us to take off our shoes while the ground and stairs were teribbly dirty. What´s the point of taking off the shoes if everywhere else is dirtier than people´s feet?"
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c46"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "There's a nice view from this statue. A bit of a climb, and make sure you have got something to protect your feet. We hadn't planned going there and didn't have socks to put on. The floor was scorching (as were our feet, which didn't add to the pleasure of the visit)."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c47"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "Went night on a holiday so temple was closed. However got to look around for less money. Many temples here charge you & donations are needed to maintain them."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c48"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "The Sri Maha Bodhi Viharaya at Bahirawakanda is a very attractive and hilly place in the Kandy Town. ... The omnipresent Buddha statue seen from everywhere in Kandy city. Take a tuk tuk ride to the Temple, just 1 km away from the Kandy city."
}
{ 
    "_id" : ObjectId("592dd8eeb99ab50bf4756c49"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "This is the 2nd largest Buddha in Sri Lanka at 88ft tall. It cost 250rupees to enter and you can climb a staircase to the level of Buddha's shoulder. The views are lovely and the Buddha itself very impressive. Well worth a visit if in Kandy"
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4a"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "This is the jewel in Polonnaruwa's impressive religious/historical crown! The statues are incredibly impressive to have been carved out of the rock and it is quite staggering how well maintained they are. Having been recently cleaned they look almost brand news, not hundreds of years old. The whole site has a significant feel and should absolutely be visited when in..."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4b"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "You have to walk about 500 meters from the vehicle park to the Gal Viharaya. There are three statues of Lord Buddha and recently they have constructed a roof to protect the statues. Higher roof would have been better but glad to see some presevation work is ongoing. Statues are very detailed and it is a perfect example of craftsmanship..."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4c"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "The Beautiful ancient temple located at the heart of Pollonaruwa.Must see place in the town. Good work from old kings"
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4d"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "The sculptures on the rocks shows the great craftsmanship of the ancient Sri Lanka. It is interesting to hear the stories about how those sculptures were rescued and prevented by even the animals of those days."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4e"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "This is the most visited area of the archaeological area, with many locals offering flowers to the Buddhas. Bring a pair of socks if you plan to visit between 9h30 and 16h30 during the dry season (April, i. e.)!!"
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c4f"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "I went to polonnaruwa after sometime and really impressed with the management of ruins there. The location is well managed with all basic facilities and given different transportation options as well."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c54"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "its the old world charm, quaint little cobblestone streets, lighthouse, huge wide stone walls of the fort, clock tower."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c50"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "This place is beautiful. You do not need long here and you must take off your shoes. The Buddhas carvings are amazing. How can they create something like that out of the rock. It looks really effective."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c51"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "Very enjoyable. If you can admire ancient ruins. This is thoroughly enjoyable. Get a bike go for a pedal, take a picnic (watch out for monkeys) enjoy several hours here."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c52"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "Certainly in our view a must see. These Buddha carvings are huge and meaningful. You can get quite close with no shoes and knees covered. No selfies. One lady tried to do a selfie of a Buddha and her. Police rushed over. She had to leave. One can't take a photo with the back turned to Buddha. Another highlight here..."
}
{ 
    "_id" : ObjectId("592dd8efb99ab50bf4756c53"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "If you are a Sri Lankan you should really feel proud of this place. Amazing site. The best would be to have the background history knowledge and visiting this place."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c55"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "This was our favorite place amongst all the locations and places we visited in Sri Lanka. It is immaculately maintained (for South Asia standards), well laid out and has lots of good quality options for shopping and eating. The Fort Printer Hotel would be an ideal place to stay while exploring this jewel, however, it was closed for annual maintenance...."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c56"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "Nice place... Thanks to the community, who has been keeping the place in its original look and it is our social responsibility to protect it for the future generation."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c57"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "The Fort area host the Galle Literary Fest. This was quite a good experience, especially the opening ceremony. Some very good restaurants and bars in the area."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c58"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "It was first built by Dutch who ruled the coastal area of Sri Lanka in the 17th Century and then by British. They built a fortress here as the place is important as a strategic point."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c59"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "Nice views from here interesting to see how much of the town you can see from here nice view of the cricket ground and the ocean"
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c5a"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "Have some nice small streets and restaurants. We went there as we were staying in Hikkaduwas anyways. Take care of hustlers though, alot of them are around the Fort."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c5b"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "The Galle Fort is really an eye candy for colonial architecture, beautiful small streets that invite for a stroll with boutique shops. Everything within the fort is easily accessible by walking and yet offers great diversity so you can easily spend a day there roaming around or sitting on the walls and watching the ocean."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c5c"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "I've loved this fort a lot. Such a picturesque and peaceful oldest forts in Galle. This fort is also known as Galle Dutch Fort. A must-visit world heritage site built by the Portuguese and the Dutch. The popular spot here is the light house and the wall beside the sea."
}
{ 
    "_id" : ObjectId("592dd8f1b99ab50bf4756c5d"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "We really enjoyed our stay at the fort. It had a very continental european feel to it but with lot's of Sri Lankan influences too. Great Restaurants and wonderful museums too. Definitely a place to visit!"
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c5e"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Like many others, we were recommended to rent a bicycle which we did. But then had to bike about 100 m down the road to go buy tickets for the entrance to the ruins (which was right across from the rental place!). Doesn't seem far, but with construction and two narrow lanes of classic Sri Lanka traffic (tuk tuks, mopeds,..."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c5f"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Wow! It was so fascinating to be taken back to the 12th century, and see the ruins built by the 3 original Buddhist kings. It is critical to go in to the museum first, so that you can understand the ruins better - they have completed models of the ruins with full stories. We had a fantastic guide from the..."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c60"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "I rented a bike in the town and rode for a few hours through the ruins. The ruins are well preserved and interesting. Read up on the site before you go as the information available at the site is quite limited. There are a number of vendors in the park that sell drinks, food, etc. so no need to pack."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c61"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "If you want to know history of Sri Lanka this is a place you want to visit. Polonnaruwa was the second capital of Sri Lanka after the destruction of Anuradhapura in 993. It comprises, besides the Brahmanic monuments built by the Cholas, the monumental ruins of the fabulous garden-city created by Parakramabahu I in the 12th century."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c62"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "After visiting Anuradhapura, I was not sure what it was going to be like, but I enjoyed it much more. The idea that it is still an archealogical site being excavated from the jungle is fascinating and whilst many of the buildings are quite ruined, there is enough left to give you a strong idea of what it must have..."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c63"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Spent a couple of hours wandering the ancient ruins of the old capital and was not disappointed. I would strongly recommend if visiting a guide is used as information is limited otherwise. Also, the site is controlled by local officials who are strict on dress codes and photography. The monuments themselves are relatively well preserved to give a clear insight..."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c64"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Okey site, but not much left of the ruins so it is not that interesting. It was very hot and many sellers trying to sell you something. Not sure I would go again"
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c65"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "We stayed in Dambulla and from there did all our visits in the region. Polonnaruwa palace buildings is one of the sites. Only stone parts of buildings and temples remain as a monument to Sri-Lanka's great past. A must visit in this area very impressive"
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c66"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "For starters, know that this place is huge and a guide is a must. We started at the museum which was nice but in desperate need of air conditioning. The various archeological sites across the grounds are beautiful. Some of the areas you must remove your shoes in order to see, and the ones in the sun are way too..."
}
{ 
    "_id" : ObjectId("592dd8f2b99ab50bf4756c67"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Pollonnaruwa is a major attraction in the north central province with many historic places to visit. The route to polonnaruwa is also amazing. From Habarana onwards its a road that winds through the minneriya national park, and if your lucky you will get to see some wild life.Especially the asian elephants who cross the roads."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c72"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "Enclosed by a wall with a frieze of elephants, this enormous restored Dagoba, 180ft high, testifies to the splendour of Anuradhapura at its peak in the 9th century. It is so big that it is difficult to take a full picture once inside the surrounding walls. We were amazed to see how 7 workers on a very tall bamboo ladder..."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c73"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "It is a very nice place. I was attracted to the peace in the place. Nice place to see Buddhists worshipping all over the place ."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c74"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "Visited this as part of the Sacred city tour. It was a holiday so crowded. About 38 degrees and you have to walk a fair way to it- long walk in the heat - barefoot on boiling hot stones."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c75"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "This was the first stupa we visited in Sri Lanka and was quite impressive, though I personally feel the open stone stupa's are more impressive than the painted white ones. This is the most visited holy site in Anuradhapura and it very busy accordingly. It was great to see this venerated site of Buddhism, though stupa's are not all that..."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c76"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "We went in the late morning so a bit hot to walk on the stone paved terrace. Recommend to carry a pair of socks which might help abit. Went around the place as it was just before vesak everything was painted and beautifully decorated."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c77"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "This was built by king Dutugemunu and is one of the biggest Stupa. Can get really crowded in Poya days and local holidays. Recommend to bring extra socks as you have to remove shoes before entering the premises with paved stones which will be burning hot in noon."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c78"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "The Ruwanwelisaya is a stupa in Sri Lanka, considered a marvel for its architectural qualities and sacred to many Buddhists all over the world. It was built by King Dutugemunu c. 140 B.C, If someone not interest better avoid because you have to be there with a good understanding, otherwise you might complain as the Ruwanweliseya is just a building..."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c79"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "This stupa was built by King Dutugamunu who reigned from 137BC to 119BC from Anuradhapura. This is the one of largest stupa in Sri Lanka and it is 103 m (338 ft) tall and 290 m (951 ft) circumference. Ruwanweli Seya is the most venerated Buddhist site in Anuradhapura."
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c7a"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "This is one of the more photogenic places in the old city but only needs a quick walk round. Popular with school trips... it was being painted when I was there which was more interesting than the place itself!"
}
{ 
    "_id" : ObjectId("592dd8f4b99ab50bf4756c7b"), 
    "Type" : "Architectural", 
    "Name" : "Ruwanwelisaya Dagoba", 
    "Review" : "One of the best places to visit if you are visiting Anuradhapura. i just want to worship it again and again."
}
{ 
    "_id" : ObjectId("592e0f0a10c2711db8f76e86"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : ""
}
{ 
    "_id" : ObjectId("592e0f0a10c2711db8f76e87"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "This is the jewel in Polonnaruwa's impressive religious/historical crown! The statues are incredibly impressive to have been carved out of the rock and it is quite staggering how well maintained they are. Having been recently cleaned they look almost brand news, not hundreds of years..."
}
{ 
    "_id" : ObjectId("592e0f0a10c2711db8f76e88"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "You have to walk about 500 meters from the vehicle park to the Gal Viharaya. There are three statues of Lord Buddha and recently they have constructed a roof to protect the statues. Higher roof would have been better but glad to see some presevation..."
}
{ 
    "_id" : ObjectId("592e0f0a10c2711db8f76e8f"), 
    "Type" : "Architectural", 
    "Name" : "Gal Vihara", 
    "Review" : "Certainly in our view a must see. These Buddha carvings are huge and meaningful. You can get quite close with no shoes and knees covered. No selfies. One lady tried to do a selfie of a Buddha and her. Police rushed over. She had to..."
}
{ 
    "_id" : ObjectId("592ed1e910c27123c4ca29e9"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "Unfortunately it was very hot afternoon when we reached this place. To remove the shoes to go up to the statue was painful. Plan a trip in the evening or when you think it would be comfortable to move and walk without shoes on the..."
}
{ 
    "_id" : ObjectId("592ed1e910c27123c4ca29eb"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "It's a nice temple to visit but our aim in going there was for the views over Kandy. It's very high up and ha great views of the town. It's 250 R entry. Slightly annoying in that once you enter - other staff then ask..."
}
{ 
    "_id" : ObjectId("592ed1e910c27123c4ca29ed"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "The view is good, but it has got a very bad road and we spent hours in traffic jam. When we arrived, they asked us to take off our shoes while the ground and stairs were teribbly dirty. What´s the point of taking off the..."
}
{ 
    "_id" : ObjectId("592ed1e910c27123c4ca29ee"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "There's a nice view from this statue. A bit of a climb, and make sure you have got something to protect your feet. We hadn't planned going there and didn't have socks to put on. The floor was scorching (as were our feet, which didn't..."
}
{ 
    "_id" : ObjectId("592ed1e910c27123c4ca29f1"), 
    "Type" : "Architectural", 
    "Name" : "Bahiravokanda Vihara Buddha Statue", 
    "Review" : "This is the 2nd largest Buddha in Sri Lanka at 88ft tall. It cost 250rupees to enter and you can climb a staircase to the level of Buddha's shoulder. The views are lovely and the Buddha itself very impressive. Well worth a visit if in..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f60c"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Wow! It was so fascinating to be taken back to the 12th century, and see the ruins built by the 3 original Buddhist kings. It is critical to go in to the museum first, so that you can understand the ruins better - they have..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f60d"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "I rented a bike in the town and rode for a few hours through the ruins. The ruins are well preserved and interesting. Read up on the site before you go as the information available at the site is quite limited. There are a number..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f60e"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "If you want to know history of Sri Lanka this is a place you want to visit. Polonnaruwa was the second capital of Sri Lanka after the destruction of Anuradhapura in 993. It comprises, besides the Brahmanic monuments built by the Cholas, the monumental ruins..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f60f"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "After visiting Anuradhapura, I was not sure what it was going to be like, but I enjoyed it much more. The idea that it is still an archealogical site being excavated from the jungle is fascinating and whilst many of the buildings are quite ruined,..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f610"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Spent a couple of hours wandering the ancient ruins of the old capital and was not disappointed. I would strongly recommend if visiting a guide is used as information is limited otherwise. Also, the site is controlled by local officials who are strict on dress..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f613"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "For starters, know that this place is huge and a guide is a must. We started at the museum which was nice but in desperate need of air conditioning. The various archeological sites across the grounds are beautiful. Some of the areas you must remove..."
}
{ 
    "_id" : ObjectId("592ed2f710c271231891f614"), 
    "Type" : "Architectural", 
    "Name" : "Polonnaruwa", 
    "Review" : "Pollonnaruwa is a major attraction in the north central province with many historic places to visit. The route to polonnaruwa is also amazing. From Habarana onwards its a road that winds through the minneriya national park, and if your lucky you will get to see..."
}
{ 
    "_id" : ObjectId("592ed4db10c2712008028ecd"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "This was our favorite place amongst all the locations and places we visited in Sri Lanka. It is immaculately maintained (for South Asia standards), well laid out and has lots of good quality options for shopping and eating. The Fort Printer Hotel would be an..."
}
{ 
    "_id" : ObjectId("592ed4db10c2712008028ed3"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "The Galle Fort is really an eye candy for colonial architecture, beautiful small streets that invite for a stroll with boutique shops. Everything within the fort is easily accessible by walking and yet offers great diversity so you can easily spend a day there roaming..."
}
{ 
    "_id" : ObjectId("592ed4db10c2712008028ed4"), 
    "Type" : "Architectural", 
    "Name" : "Galle Fort", 
    "Review" : "I've loved this fort a lot. Such a picturesque and peaceful oldest forts in Galle. This fort is also known as Galle Dutch Fort. A must-visit world heritage site built by the Portuguese and the Dutch. The popular spot here is the light house and..."
}
