{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756bdc"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Had a great time spotting wild animals but the leopard was too elusive for us at this time but still we loved it."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756bdd"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Having been on safari in Kenya to see the big five, this didn't really compare, however my partner has never done anything like this before and absolutely loved it! Our driver made sure that we got to see everything that we could, we actually managed to see one of the park's leopards (which is quite a rare sight apparently and..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756bde"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Safari is always based on luck. We were lucky enough to see all the animals including leopard Inna short time. Probably the off season also helped by having less number of Jeep's. But starting early by 5:30 could be the key to watch most of the animals before it could get hot. The beach within the forest is also a..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756bdf"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Safari was very good. saw leopards, loads of elephants, wild boar, crocodiles, buffalo and many birds. I would say that everyone's experience varies depending on the tour company used. In the morning there were a lot of jeeps and they were going at varying speeds so be prepared fora. Bumpy ride. The park itself is lovely and either a morning..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be0"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Having been to Udawalawe a few days before, our guide had built Yala up to be so much better, but we did not agree. We saw a few leopards which was an incredible experience and one I will never forget, but it was tempered by the amount of safari jeeps that converge on any spot a leaopard is sighted. The..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be1"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "You just have to do this, even if a bit pricy. I went for a one day tour, so not rushing around but staying for 45 Minutes at the same location watching a well hidden leopard!"
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be2"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Great days visit to Yala National park with an experienced guide (well worth enduring you get) who shows us everything the park has to offer except there was no sign of the Bears. Lots of water buffalo, wild boar, Land monitor lizards, spectacular birds, Crocodiles, Mongoose etc. Let them provide you with your lunch as it was one of the..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be3"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Was looking forward to my first safari experience and to be fair we saw elephants, sleeping leopards, deer, water buffalo, macaque monkeys and a mongoose or two which was fantastic. Had our guide had some finesse and appreciation of the smaller things, we might have seen some birds and smaller mammals, and got a feel for the magic of the..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be4"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Did the afternoon tour maybe better to have the morning one.Was disappointed at the animals I saw for the price I paid.i had my own jeep and paid a total of 10,000 rupees organised by my private driver .No leopard or bear.Saw crocodiles & deer from a distance ,was closer to wild boar ,peacocks & water buffalo and elephants.Could have..."
}
{ 
    "_id" : ObjectId("592dd8e1b99ab50bf4756be5"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "This is a good place if you want to see elephants and all sorts of wild birds, deers and bears. I didn't see the leopard but I certainly enjoyed the 6 hours spent trying to spot wildlife. Bring ample supply of water, sunscreen and a hat. Early risers get a better chance of spotting wildlife here."
}
{ 
    "_id" : ObjectId("592dd8e2b99ab50bf4756be6"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "Place is our of this world. Beautiful trees and wild animals. A must see. Can drive around and it is very safe"
}
{ 
    "_id" : ObjectId("592dd8e2b99ab50bf4756be7"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "it was amazing nature trail.... i had so much fun by watching the rare birds..... it was unbelievable natural landscaping....."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756be8"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "after doing the Baker's Falls (as I recommend in my Horton Plain reviews) & walking for some more time.. in the Horton Plains trek u come to a place where there is no land mass ahead. As the Name says !! World's End.. with a Beautiful Breath Taking View, across the mountains u can see Clouds & more clouds, as..."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756be9"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "The hike to the actual 'worlds end' point took an hour or so. Relatively easy and short compared to climbing Adams Peak! Young and old alike should be able to complete this hike albeit, taking a bit of care and little more time. Once you get there, the view is simply breathtaking. Theres no fences or the like to prevent..."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756bea"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "I think this is a must do when visiting Sri Lanka. The whole walk is very pleasant, the views are wonderful and the World´s End is just stunning. The walk is just a little bit uphill so anyone can do it. Definitely start at 6 AM as it gets hot quickly. There is a reindeer walking around the entrance gate..."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756beb"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "We were very excited about coming to Horton's Plains and World's End was mainly why. It did not disappoint in any way. Lots of tourists, but not too many to dampen the experience, the views from little World's End and then World's End are just breathtaking. We were lucky enough to reach it before the cloud ascended and then to..."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756bec"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "It takes approx 3 hours. Start early in the morning around 6.30 when it is cooler. Bring water and wear comfortable shoes. The view is fantastic."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756bed"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "it was nature gift.....every where lush green and unbelievable natural landscape...only bad experiences was ticket fees were really expensive...."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756bee"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "It takes about 3 hours to complete the whole walk. I got there by Jeep but also saw locals driving their car to get there. Best to check with your driver / get hotel to arrange for a jeep. Best to go early as clouds start rolling in by 9.30am. There are two route options. I took the one heading..."
}
{ 
    "_id" : ObjectId("592dd8e3b99ab50bf4756bef"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "We did this hiking tour but was a little bit disappointed due to the fact there was not much to see. The scenery is like being in the highlands of Scotland. In my opinion it was not worth getting up at 4am to travel there for."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf0"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "There is something special about Ella Rock. It's almost as if the demand for hikers hasn't been met as the trails are often hidden and much of the starting path remains alongside the train tracks. Reflective of Sri Lanka, it's a hike that's worth the effort to try a little harder. Seemingly endless ways to reach the summit, I suggest..."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf1"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "There is no signage here but possible to do on your own. You mostly walk along the tracks until you pass Kitaella Station and look for a second turning to the left. You'll see a small stream at this point. From there, you'll just follow the path. It gets slightly steep at some points. Great view at the top!"
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf2"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "so we did the ella rock today in mai 2017 with the map from tripadviser. so people from the guesthouse told us it is pretty easy. on the way back we thought the same, but the way to the rock was not that easy because everybody is lieing to you, dont trust anyone, dont get confused and trust yourself. pic..."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf3"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "We set off at 9am and began our walk along the railway line heading out of Ella, at first I was weary walking along a train track, however there are only ten trains a day running through Ella and they chug along at a pace of 15kmp/h. You can hear the trains from quite a way off, so there's plenty..."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf4"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "We set off at 8am in order to avoid walking in the midday sun. The first part of the walk is very straight forward and is just following the train tracks. When you leave the tracks you will cross a concrete bridge. Immediately after, the path forks with 3 ways to go. On the way up we took the middle..."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf5"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "My great tour with german guest ella area dummacabs@gmail.com Highest water fall and demodara bridge Much more places cool and superb weather"
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf6"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "This is a steep climb in the heat and humidity but it is worth it when you get to the top. There are great views unfortunately due to the altitude it can be misty. It can be clearer I. The mornings so go early."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf7"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "If you're expecting a out of breath view... don't count on that. The trip is worth because of the exercice that you have to do in order to get to the top. Be prepared to climb 1.30h /1.45h.. and BE AWARE! You'll find local people that will say to you to cut left into the mountain way earlier than you..."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf8"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "Ella rock is a very nice place from where one gets to see the amazing view of the water falls. Throughout the way we get to see many small natural falls but this view is fabulous."
}
{ 
    "_id" : ObjectId("592dd8e4b99ab50bf4756bf9"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "Nice hike! About 2 hours to the hill. This time too hot weather! It is better to go early morning.You can buy good coconut during the way :-)"
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bfa"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Adam's Peak 2,243 m (7,359 ft) tall conical mountain located in central Sri Lanka - just 40 minutes away from the Bungalow (Clovefield Villa) - Also known as Sri Pada Mountain. Usualy climbing season is from May to December but you can climb during the off season too with a Trekker. You will be able to see nice sceneries during..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bfb"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Adam's Peak (Butterfly Mountain) it's only take two or three hours to summit this little mountain, the great one was the sunrise, it's very beautiful moment with the buddhist sound from the crowd"
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bfc"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Should you climb Adam's Peak? If you like adventure, and a bit of a challenge: YES, it's rewarding and can be fun. If climbing ten flights of stairs leaves you begging for the sweet release of death, this is not the best of ideas. Here are some practical tips for those looking to climb Adam's Peak. WHEN to climb: In..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bfd"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "We travelled from Bentota to Siri Padaya with Sumi Tours. Our guide Sumi and driver Prasad couldn't do enough to assist us with our experience. Siri Padaya was amazing a 3 and 1/2 hour climb leaving the base at 2am to catch the sunrise at 6.15am. Thoroughly worth the effort but climb is challenging!!!!"
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bfe"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "my last trip to Adam's peak was the 5th one.It is really a worthy lifetime experience, the journey and the destination both!. We stayed in a hotel called 'White Elephant'prior to starting climbing at 2 am.\"White Elephant' is not a place that I would recommend. But the rest of the trip was really great.It took us about 4 hours to..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756bff"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "If you want a nice walk / hike up a mountain don't do this walk! We went on a Thursday night / Friday morning and the way up wasn't too bad in terms of how busy it was but the way down was ridiculous, we were getting squashed and shouted at, and there was hardly any space to come down..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756c00"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "I will not talk about religion etc. but only about the climbing experience. Spiritual thing is as you let it to be. We started climbing at 2AM and arrived to the top 5.30AM. We are rather sporty people but at the top we felt the speed we took. The temperature difference is around 15deg Celcius so better take some warm..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756c01"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "It was a good experience, the exercise was needed after loafing around for some weeks. After reading some reviews I thought it would be much harder, but if you have an average level of fitness then it's just a couple of hours of huffing and puffing. If you are pretty fit you shouldn't start until at least 3am, as you..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756c02"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Definitely worth the effort. Expect to have sore calves for a few days..One of the best travel experiences I have ever done..The sunrise and the people make this journey worth every step...Don't pack too much and don't go too hard too early..I did it in 2 and a half hours and I'm 52 with reasonable fitness..very inspiring to the variations..."
}
{ 
    "_id" : ObjectId("592dd8e5b99ab50bf4756c03"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Did the trek this year via Kuruvita trail (Erathna Route), which is approximately 16km one way and the most toughest track to the peak! During the season you have the track lit. Half the distance is without any steps just jumping over the rocks! Expect wildlife too although not much during the season... takes about 12hours to reach the peak...."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c04"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Right now its the Buddhist holiday of Vesak (Buddha's birthday). Everywhere at night is a blaze of colorful lights and they are reflected over the lake. The lake itself takes about an hour to walk around and takes you past the Temple of the Tooth"
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c05"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "A scenic addition to Kandy City during my childhood has turned in to a bad smelling collection of water and you can see the water all turned in to green due to heavy algae growth and fish are dying. Hydrogen sulphide smell is everywhere. This is what the surrounding hotels and the irresponsible citizens of Kandy has done to this..."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c06"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Around the lake there are people selling stuff and food. You can also buy food for the fishes(huge fishes btw). Quite pretty I'd say."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c07"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Lake has an amazing view , amazing nature . Fantastic to walk around the lake but the garbages around of it ,makes it horrible . Such an amazing area but you will be not able to find a garbage bin around..."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c08"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Kandy lake may look nice from a far but it's basically just a large body of grimy water bordered by a littered footpath. You can try to stroll peacefully along here but you will be hassled by street vendors, tuk drivers and people trying to drag you along to Kandyan dance shows. I would not recommend a visit to Kandy..."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c09"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "The setup and cleanliness of lake and environment around makes it symbol of serenity . Good spot for great photos.."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c0a"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "It's impossible to be in Kandy for long before you are drawn to the beautiful lake. If fit enough, you can actually walk all the way around it, although at the time of writing part of the path is being repaired. Thereby hangs a tale, because repairs, and elsewhere walls being freshly repainted in white, point to a system that..."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c0b"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Not worth a visit. Too much trafic around the lake. And the water smells really bad. We saw dead fish laying in the water, when we were there"
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c0c"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Nice for a stroll if you've got the time. We saw a pelican in a tree and a water monitor as we were walking. we went late afternoon. I think early morning might be more rewarding."
}
{ 
    "_id" : ObjectId("592dd8e6b99ab50bf4756c0d"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "big lake ...very religious ...got graves in the middle...people feed the fish and birds...lovely to take a walk"
}
{ 
    "_id" : ObjectId("592dd8fcb99ab50bf4756cb9"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "There is no signage here but possible to do on your own. You mostly walk along the tracks until you pass Kitaella Station and look for a second turning to the left. You'll see a small stream at this point. From there, you'll just follow..."
}
{ 
    "_id" : ObjectId("592dd8fcb99ab50bf4756cba"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "so we did the ella rock today in mai 2017 with the map from tripadviser. so people from the guesthouse told us it is pretty easy. on the way back we thought the same, but the way to the rock was not that easy because..."
}
{ 
    "_id" : ObjectId("592dd8fcb99ab50bf4756cbb"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "We set off at 9am and began our walk along the railway line heading out of Ella, at first I was weary walking along a train track, however there are only ten trains a day running through Ella and they chug along at a pace..."
}
{ 
    "_id" : ObjectId("592dd8fcb99ab50bf4756cbc"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "We set off at 8am in order to avoid walking in the midday sun. The first part of the walk is very straight forward and is just following the train tracks. When you leave the tracks you will cross a concrete bridge. Immediately after, the..."
}
{ 
    "_id" : ObjectId("592dd8fcb99ab50bf4756cbf"), 
    "Type" : "Nature", 
    "Name" : "Ella Rock", 
    "Review" : "If you're expecting a out of breath view... don't count on that. The trip is worth because of the exercice that you have to do in order to get to the top. Be prepared to climb 1.30h /1.45h.. and BE AWARE! You'll find local people..."
}
{ 
    "_id" : ObjectId("592dd8feb99ab50bf4756ccc"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "A scenic addition to Kandy City during my childhood has turned in to a bad smelling collection of water and you can see the water all turned in to green due to heavy algae growth and fish are dying. Hydrogen sulphide smell is everywhere. This..."
}
{ 
    "_id" : ObjectId("592dd8feb99ab50bf4756ccf"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "Kandy lake may look nice from a far but it's basically just a large body of grimy water bordered by a littered footpath. You can try to stroll peacefully along here but you will be hassled by street vendors, tuk drivers and people trying to..."
}
{ 
    "_id" : ObjectId("592dd8feb99ab50bf4756cd1"), 
    "Type" : "Nature", 
    "Name" : "Kandy Lake", 
    "Review" : "It's impossible to be in Kandy for long before you are drawn to the beautiful lake. If fit enough, you can actually walk all the way around it, although at the time of writing part of the path is being repaired. Thereby hangs a tale,..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee2"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Having been on safari in Kenya to see the big five, this didn't really compare, however my partner has never done anything like this before and absolutely loved it! Our driver made sure that we got to see everything that we could, we actually managed..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee3"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Safari is always based on luck. We were lucky enough to see all the animals including leopard Inna short time. Probably the off season also helped by having less number of Jeep's. But starting early by 5:30 could be the key to watch most of..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee4"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Safari was very good. saw leopards, loads of elephants, wild boar, crocodiles, buffalo and many birds. I would say that everyone's experience varies depending on the tour company used. In the morning there were a lot of jeeps and they were going at varying speeds..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee5"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Having been to Udawalawe a few days before, our guide had built Yala up to be so much better, but we did not agree. We saw a few leopards which was an incredible experience and one I will never forget, but it was tempered by..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee7"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Great days visit to Yala National park with an experienced guide (well worth enduring you get) who shows us everything the park has to offer except there was no sign of the Bears. Lots of water buffalo, wild boar, Land monitor lizards, spectacular birds, Crocodiles,..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee8"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Was looking forward to my first safari experience and to be fair we saw elephants, sleeping leopards, deer, water buffalo, macaque monkeys and a mongoose or two which was fantastic. Had our guide had some finesse and appreciation of the smaller things, we might have..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76ee9"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Did the afternoon tour maybe better to have the morning one.Was disappointed at the animals I saw for the price I paid.i had my own jeep and paid a total of 10,000 rupees organised by my private driver .No leopard or bear.Saw crocodiles & deer..."
}
{ 
    "_id" : ObjectId("592e0f1b10c2711db8f76eea"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "This is a good place if you want to see elephants and all sorts of wild birds, deers and bears. I didn't see the leopard but I certainly enjoyed the 6 hours spent trying to spot wildlife. Bring ample supply of water, sunscreen and a..."
}
{ 
    "_id" : ObjectId("592ed03810c2710774118fd0"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Nice park with a lot of different animals. But very crowded with long ques of tourist jeeps. We took afternoon jeep safari and we've seen elephant family, black bear, deers, boar, bisons, crocodiles, mongooses, etc. No leopards on our tour.. The next day we went to Bundala Park -- what amazing and peaceful tour! We were almost alone in the..."
}
{ 
    "_id" : ObjectId("592ed03810c2710774118fd1"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Enjoyed good day out saw some animals but not as many as we would of hoped but that is the way safari goes only complaint is that five hours on a jeep without a break is a bit much should consider putting some portable toilets somewhere"
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fdb"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "after doing the Baker's Falls (as I recommend in my Horton Plain reviews) & walking for some more time.. in the Horton Plains trek u come to a place where there is no land mass ahead. As the Name says !! World's End.. with a..."
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fdc"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "The hike to the actual 'worlds end' point took an hour or so. Relatively easy and short compared to climbing Adams Peak! Young and old alike should be able to complete this hike albeit, taking a bit of care and little more time. Once you..."
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fdd"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "I think this is a must do when visiting Sri Lanka. The whole walk is very pleasant, the views are wonderful and the World´s End is just stunning. The walk is just a little bit uphill so anyone can do it. Definitely start at 6..."
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fde"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "We were very excited about coming to Horton's Plains and World's End was mainly why. It did not disappoint in any way. Lots of tourists, but not too many to dampen the experience, the views from little World's End and then World's End are just..."
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fe1"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "It takes about 3 hours to complete the whole walk. I got there by Jeep but also saw locals driving their car to get there. Best to check with your driver / get hotel to arrange for a jeep. Best to go early as clouds..."
}
{ 
    "_id" : ObjectId("592ed03910c2710774118fe2"), 
    "Type" : "Nature", 
    "Name" : "World's End", 
    "Review" : "We did this hiking tour but was a little bit disappointed due to the fact there was not much to see. The scenery is like being in the highlands of Scotland. In my opinion it was not worth getting up at 4am to travel there..."
}
{ 
    "_id" : ObjectId("592ed4ce10c2712008028e5a"), 
    "Type" : "Nature", 
    "Name" : "Yala National Park", 
    "Review" : "Enjoyed good day out saw some animals but not as many as we would of hoped but that is the way safari goes only complaint is that five hours on a jeep without a break is a bit much should consider putting some portable toilets..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f51a"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : ""
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f51b"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Adam's Peak 2,243 m (7,359 ft) tall conical mountain located in central Sri Lanka - just 40 minutes away from the Bungalow (Clovefield Villa) - Also known as Sri Pada Mountain. Usualy climbing season is from May to December but you can climb during the..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f51d"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Should you climb Adam's Peak? If you like adventure, and a bit of a challenge: YES, it's rewarding and can be fun. If climbing ten flights of stairs leaves you begging for the sweet release of death, this is not the best of ideas. Here..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f51e"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "We travelled from Bentota to Siri Padaya with Sumi Tours. Our guide Sumi and driver Prasad couldn't do enough to assist us with our experience. Siri Padaya was amazing a 3 and 1/2 hour climb leaving the base at 2am to catch the sunrise at..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f51f"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "my last trip to Adam's peak was the 5th one.It is really a worthy lifetime experience, the journey and the destination both!. We stayed in a hotel called 'White Elephant'prior to starting climbing at 2 am.\"White Elephant' is not a place that I would recommend...."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f520"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "If you want a nice walk / hike up a mountain don't do this walk! We went on a Thursday night / Friday morning and the way up wasn't too bad in terms of how busy it was but the way down was ridiculous, we..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f521"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "I will not talk about religion etc. but only about the climbing experience. Spiritual thing is as you let it to be. We started climbing at 2AM and arrived to the top 5.30AM. We are rather sporty people but at the top we felt the..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f522"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "It was a good experience, the exercise was needed after loafing around for some weeks. After reading some reviews I thought it would be much harder, but if you have an average level of fitness then it's just a couple of hours of huffing and..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f523"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Definitely worth the effort. Expect to have sore calves for a few days..One of the best travel experiences I have ever done..The sunrise and the people make this journey worth every step...Don't pack too much and don't go too hard too early..I did it in..."
}
{ 
    "_id" : ObjectId("592ed59b10c2711ec898f524"), 
    "Type" : "Nature", 
    "Name" : "Adam's Peak", 
    "Review" : "Did the trek this year via Kuruvita trail (Erathna Route), which is approximately 16km one way and the most toughest track to the peak! During the season you have the track lit. Half the distance is without any steps just jumping over the rocks! Expect..."
}
